
#ifndef _crc16_H
#define _crc16_H
//-----------------------------------------------------------------------------

#include "stm32f10x.h"

//-----------------------------------------------------------------------------
// Расчет CRC16 при помощи встроенного модуля.
//void CRC_Init(void);
//uint16_t Get_Crc16(uint8_t *buf, uint8_t len);


//Расчет CRC16 по полиному 0x8005 с 0 начальным значением
uint16_t Get_Crc16(uint8_t *pcBlock, uint8_t len);
//-----------------------------------------------------------------------------
#endif /*_crc16_H*/

