
#include "dma_ST.h"

//***************************************************************************************************
//************************Аппаратный уровень DMA1 Ch2.***********************************************
//Инициализация канала 2 DMA1 передачи данных через USART1.   
void DMA1Ch2InitForTX(USART_TypeDef *usart){
  
  //Задать адрес источника и приемника и количество данных для обмена
  DMA1_Channel2->CPAR = (uint32_t)&usart->DR;   //адрес регистра перефирии
  //----------------- Манипуляции с регистром конфигурации  ----------------
  //Следующие действия можно обьединить в одну команду (разбито для наглядности)
	//После сброса значение CCR = 0.
  //DMA1_Channel4->CCR  =  0;                       //предочистка регистра конфигурации
  //DMA1_Channel4->CCR &= ~DMA_CCR4_CIRC;           //выключить циклический режим
  DMA1_Channel2->CCR |= DMA_CCR2_DIR;            //направление: чтение из памяти
  //Настроить работу с переферийным устройством
  //DMA1_Channel4->CCR &= ~DMA_CCR4_PSIZE;          //размерность данных 8 бит
  //DMA1_Channel4->CCR &= ~DMA_CCR4_PINC;           //неиспользовать инкремент указателя
  //Настроить работу с памятью
  //DMA1_Channel4->CCR &= ~DMA_CCR4_MSIZE;          //размерность данных 8 бит
  DMA1_Channel2->CCR |=  DMA_CCR2_MINC;           //использовать инкремент указателя

  DMA1_Channel2->CCR |= DMA_CCR2_TCIE;     //Разрешить прерывание по завершении обмена
	//NVIC_SetPriority(DMA1_Channel2_IRQn, 14);//Приоритет прерывания
  NVIC_EnableIRQ (DMA1_Channel2_IRQn);     //Разрешить прерывания от DMA канал №2  
}
//-----------------------------------------------------------------------------
//Старт обмена в канале "память-DMA-USARTx"                                                                   
void DMA1Ch2StartTX(uint8_t *buf, uint16_t size){
  
  DMA1_Channel2->CCR  &= ~DMA_CCR2_EN; //запретить работу канала
  DMA1_Channel2->CMAR  = (uint32_t)buf;//адрес буфера в памяти
  DMA1_Channel2->CNDTR = size;       	 //загрузить количество данных для обмена  
  DMA1_Channel2->CCR  |= DMA_CCR2_EN;	 //разрешить работу канала
}
//-----------------------------------------------------------------------------
//Прерываение от DMA1_Ch2.
void DMA1_Channel2_IRQHandler(void){
  
	//RelayOrLedToggle(LedRS485);//Моргаем светодиодом.
  //-------------------------
  //Обмен завершен.
  if(DMA1->ISR & DMA_ISR_TCIF2)
    {
			DMA1->IFCR |= DMA_IFCR_CTCIF2;     //сбросить флаг окончания обмена.
      DMA1_Channel2->CCR &= ~DMA_CCR2_EN;//запретить работу канала.
      //Это нужно что бы дождаться завершения передачи последнего байта.
      USART3->CR1 |= USART_CR1_TCIE;		 //Включение прерывания по окончанию передачи USART1.	
    }      
//  //-------------------------
//  //Передана половина буфера
//  if(DMA1->ISR & DMA_ISR_HTIF2)
//    {

//    }  
//  //-------------------------
//  //Произошла ошибка при обмене
//  if(DMA1->ISR & DMA_ISR_TEIF2)
//    {

//    }   
//  //-------------------------
}
//***************************************************************************************************
//************************Аппаратный уровень DMA1 Ch5.***********************************************
//Инициализация канала 5 DMA1 для приема данных из USART1.   
void DMA1Ch5InitForRX(void){
  
  //DMA1_Channel5->CMAR = (uint32_t) &RxBuff[0];//адрес буфера приемника.
  DMA1_Channel5->CPAR = (uint32_t)&USART1->DR;  //адрес регистра данных приемника.
  //DMA1_Channel5->CNDTR = 64;                  //количество данных для приема.
  //--------------------
  //Настроить работу с переферийным устройством
  DMA1_Channel5->CCR  =  0;                 //предочистка регистра конфигурации
  DMA1_Channel5->CCR &= ~DMA_CCR5_CIRC;     //выключить циклический режим
  DMA1_Channel5->CCR &= ~DMA_CCR5_DIR;      //направление: чтение из перифферии.
  DMA1_Channel5->CCR &= ~DMA_CCR5_PSIZE;    //размерность данных 8 бит
  DMA1_Channel5->CCR &= ~DMA_CCR5_PINC;     //неиспользовать инкремент указателя
  //--------------------
  //Настроить работу с памятью
  DMA1_Channel5->CCR &= ~DMA_CCR5_MSIZE;    //размерность данных 8 бит
  DMA1_Channel5->CCR |=  DMA_CCR5_MINC;     //использовать инкремент указателя
  //--------------------
  DMA1_Channel5->CCR |= DMA_CCR5_TCIE;      //Разрешить прерывание по завершении обмена
  NVIC_EnableIRQ(DMA1_Channel5_IRQn);       //Разрешить прерывания от DMA канал №5
}
//-----------------------------------------------------------------------------
//Старт канала 5 DMA1 для приема данных из USART1.                                                            
void StartDMA1Ch5ForRX(uint8_t *BuffAdr, uint16_t LengthBufer){
  
  //RS485REOn;           //Микросхему на прием.
  //--------------------
  DMA1_Channel5->CCR  &= ~DMA_CCR5_EN;     //запретить работу канала
  DMA1_Channel5->CMAR  = (uint32_t)BuffAdr;//адрес буфера приемника.
  DMA1_Channel5->CNDTR = LengthBufer;      //загрузить количество данных для обмена
  DMA1_Channel5->CCR  |= DMA_CCR5_EN;//разрешить работу канала
}
//-----------------------------------------------------------------------------
//Прерываени от DMA1_Ch5.
void DMA1_Channel5_IRQHandler(void){
   
  //static uint8_t LedState = 0;
  //uint16_t CRCtemp = 0;
  //-------------------------
  //Если обмен завершен
  if(DMA1->ISR & DMA_ISR_TCIF5)
    {
      DMA1_Channel5->CCR  &= ~DMA_CCR5_EN;//запретить работу канала.
      DMA1->IFCR |= DMA_IFCR_CTCIF5;      //сбросить флаг окончания обмена.
      //-------------------------
      //Анализ ответа от MB.
//      CRCtemp = Get_Crc16(ReceiverBufferSTR.BLK, (ReceiverBufferSTR.STR.Size - 2));
//      if (((uint8_t)(CRCtemp >> 8)     == ReceiverBufferSTR.BLK[ReceiverBufferSTR.STR.Size ]) &&
//          ((uint8_t)(CRCtemp & 0x00FF) == ReceiverBufferSTR.BLK[ReceiverBufferSTR.STR.Size - 1]))
//        {
////          LedState ^= LedGreen;            
////          CommunicationLedSet(LedState);     //Моргаем светодиодом.

////          RS485ClearReceiverBuffer();
////          NVIC_EnableIRQ(USART1_IRQn);//Разрешаем прерывание от приемника USART1.

//          RS485SetFlagReg(RS485_MB_Flag);
//        }
      //-------------------------
    }      
  //-------------------------
  //Если передана половина буфера
  if(DMA1->ISR & DMA_ISR_HTIF5)
    {

    }  
  //-------------------------
  //Если произошла ошибка при обмене
  if(DMA1->ISR & DMA_ISR_TEIF5)
    {

    }   
  //-------------------------
}
//***************************************************************************************************
//***************************************************************************************************









