
#include "timers_ST.h"

//-----------------------------------------------------------------------------
void Tim1Init(void){

  //Тактирование  GPIOA , TIM1, альтернативных функций порта
	RCC->APB2ENR |= RCC_APB2ENR_IOPAEN | RCC_APB2ENR_TIM1EN | RCC_APB2ENR_AFIOEN;
        
  //PA11 push-pull
	GPIOA->CRH &= ~GPIO_CRH_CNF11;
	GPIOA->CRH |= GPIO_CRH_CNF11_1;

	GPIOA->CRH	&= ~GPIO_CRH_MODE11;
	GPIOA->CRH	|= GPIO_CRH_MODE11_1;
	
	TIM1->PSC  = 72; //делитель
  TIM1->ARR  = 288;//значение перезагрузки. 288 значение для частоты ~3400Гц.
	TIM1->CCR4 = 28; //144;//коэф. заполнения. 144 это 50%
	//настроим на выход канал 4, 
	TIM1->CCER |= TIM_CCER_CC4E;//активный уровень высокий  
  //TIM1->CCER |= TIM_CCER_CC4P;//активный уровень низкий 
	//разрешим использовать выводы таймера как выходы
	//TIM1->BDTR |= TIM_BDTR_MOE;
	//PWM mode 1, прямой ШИМ 4 канал
  TIM1->CCMR2 = TIM_CCMR2_OC4M_2 | TIM_CCMR2_OC4M_1; 
  //если надо настроить первый канал, это можно сделать так
  //TIM1->CCMR1 = TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1;
	TIM1->CR1 &= ~TIM_CR1_DIR;//считаем вверх
	TIM1->CR1 &= ~TIM_CR1_CMS;//выравнивание по фронту, Fast PWM
	
	//Отключение зуммера для тестирования на ЭМС!!!!!
	TIM1->CR1 |=  TIM_CR1_CEN;//включаем счётчик
}
//*****************************************************************************
//*****************************************************************************
//Прерываени системного таймера TIM1.
void TIM1_Handler(void){
  	
}
//*****************************************************************************
//*****************************************************************************


